app/controllers/url_examples_controller.rb

SELECT  "url_examples".* FROM "url_examples"  ORDER BY "url_examples"."longUrl" ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "url_examples"
---
  def index
    @url_examples = UrlExample.order(:longUrl).page(params[:page]).per(5)

UPDATE "url_examples" SET "qtdAcesso" = ?, "updated_at" = ? WHERE "url_examples"."id" = ?  [["qtdAcesso", "1"], ["updated_at", "2017-09-09 22:50:33.747641"], ["id", 29]]
---
  def show
    @url_example.qtdAcesso = ((@url_example.qtdAcesso).to_i + 1).to_s

    @url_example.save

SELECT "url_examples".* FROM "url_examples" WHERE "url_examples"."customAlias" = ?  [["customAlias", "um72"]]
SELECT COUNT(*) FROM "url_examples" WHERE "url_examples"."customAlias" = ?  [["customAlias", "um72"]]
INSERT INTO "url_examples" ("longUrl", "customAlias", "shortUrl", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["longUrl", "qqqq"], ["customAlias", ""], ["shortUrl", "um"], ["created_at", "2017-09-09 22:01:28.528390"], ["updated_at", "2017-09-09 22:01:28.528390"]]
---
  def create
    require 'securerandom'
    @url_example = UrlExample.new(url_example_params)

    @aux = UrlExample.where(customAlias: @url_example.customAlias)

    #Verifica se o custom alias já foi cadastrao
    if(@aux.count<1)
      ##Verifica se a URL é valida
      if(@url_example.longUrl[0, 7] == 'http://' || @url_example.longUrl[0, 8] == 'https://')

        #redirect_to @url_example.longUrl

        @url_example.shortUrl = 'https://shorturl/'


        if(@url_example.customAlias == nil || @url_example.customAlias == '' || @url_example.customAlias == ' ')
          @url_example.customAlias = SecureRandom.hex(2) + rand(1..10).to_s
        end

        @url_example.shortUrl = @url_example.shortUrl << @url_example.customAlias

DELETE FROM "url_examples" WHERE "url_examples"."id" = ?  [["id", 2]]
---
  def destroy
    @url_example.destroy

SELECT  "url_examples".* FROM "url_examples" WHERE "url_examples"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_url_example
      @url_example = UrlExample.find(params[:id])